Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TC_8_9_CDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAN_0_CSEL</name>
                     <description>CAN0 Clock Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CAN_0_CSELSelect</name>
                        <enumeratedValue>
                           <name>NO_CLK</name>
                           <description>No Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>Reference Clock 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>Reference Clock 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>Reference Clock 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>Reference Clock 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO5</name>
                           <description>Reference Clock 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO6</name>
                           <description>Reference Clock 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPCLK</name>
                           <description>32 KHz Low Power Clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAN_0_CD</name>
                     <description>CAN0 Clock Disable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CAN_0_CDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAN_1_CSEL</name>
                     <description>CAN1 Clock Selection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CAN_1_CSELSelect</name>
                        <enumeratedValue>
                           <name>NO_CLK</name>
                           <description>No Clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>Reference Clock 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>Reference Clock 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>Reference Clock 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>Reference Clock 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO5</name>
                           <description>Reference Clock 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO6</name>
                           <description>Reference Clock 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPCLK</name>
                           <description>32 KHz Low Power Clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAN_1_CD</name>
                     <description>CAN1 Clock Disable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CAN_1_CDSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable PGCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable PGCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USER_ID</name>
               <addressOffset>0xc0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>USER_ID</name>
                     <description>User unique ID, readable using the SWD USER_ID instruction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSKEY</name>
               <addressOffset>0xd0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYSKEY</name>
                     <description>System Key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMD1</name>
               <addressOffset>0xe0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACMD</name>
                     <description>DAC Module Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMD</name>
                     <description>AC Module Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCMD</name>
                     <description>ADC Controller Module Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCSARMD</name>
                     <description>ADC SAR Core Module Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CVDMD</name>
                     <description>ADC CVD Module Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCSARSHRMD</name>
                     <description>Shared ADC SAR Core Module Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCCMD</name>
                     <description>RTCC Module Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SQIMD</name>
                     <description>SQI Module Disable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMD2</name>
               <addressOffset>0xf0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REFO5MD</name>
                     <description>Reference (Clock) Out 5 Module Disable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFO6MD</name>
                     <description>Reference (Clock) Out 6 Module Disable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFO1MD</name>
                     <description>Reference (Clock) Out 1 Module Disable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFO2MD</name>
                     <description>Reference (Clock) Out 2 Module Disable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFO3MD</name>
                     <description>Reference (Clock) Out 3 Module Disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFO4MD</name>
                     <description>Reference (Clock) Out 4 Module Disable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMD3</name>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SER0MD</name>
                     <description>SERCOM0 Module Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SER1MD</name>
                     <description>SERCOM1 Module Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SER2MD</name>
                     <description>SERCOM2 Module Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SER3MD</name>
                     <description>SERCOM3 Module Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SER6MD</name>
                     <description>SERCOM6 Module Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QEIMD</name>
                     <description>QEI Module Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC0MD</name>
                     <description>TC0 Module Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC1MD</name>
                     <description>TC1 Module Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC2MD</name>
                     <description>TC2 Module Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC3MD</name>
                     <description>TC3 Module Disable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC4MD</name>
                     <description>TC4 Module Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC5MD</name>
                     <description>TC5 Module Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC6MD</name>
                     <description>TC6 Module Disable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC7MD</name>
                     <description>TC7 Module Disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC8MD</name>
                     <description>TC8 Module Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC9MD</name>
                     <description>TC9 Module Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC0MD</name>
                     <description>TCC0 Module Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC1MD</name>
                     <description>TCC1 Module Disable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC2MD</name>
                     <description>TCC2 Module Disable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN0MD</name>
                     <description>CAN0 Module Disable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN1MD</name>
                     <description>CAN1 Module Disable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MISCSTAT</name>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <resetValue>0x01000081</resetValue>
               <fields>
                  <field>
                     <name>CLDORDY</name>
                     <description>CLDO Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CM4SWRST_EN</name>
                     <description>CM4 SW Reset Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID</name>
               <description>Device ID</description>
               <addressOffset>0x160</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>BCFG0</name>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PCSCMODE</name>
                     <description>PCHE Single cache Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP</name>
                     <description>Boot Code Protect</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIGN</name>
                     <description>Flash SIGN</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BINFOVALID0</name>
                     <description>First 256-bit BCFG information Valid</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGCON0CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON0SET</name>
               <description>Bit set register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON0INV</name>
               <description>Bit invert register</description>
               <addressOffset>0xc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON1SET</name>
               <description>Bit set register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x1c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON2CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON2SET</name>
               <description>Bit set register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON2INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x2c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON4CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON4SET</name>
               <description>Bit set register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFGCON4INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x4c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
