Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
            <register>
               <name>PB2DIV</name>
               <description>PB2 CLOCK DIVISOR CONTROL REGISTER</description>
               <addressOffset>0x170</addressOffset>
               <size>32</size>
               <resetValue>0x8801</resetValue>
               <fields>
                  <field>
                     <name>PBDIV</name>
                     <description>PB2 Peripheral Clock Divisor Control value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide by 1 PB2 Clock same frequency as sys_clk</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2 PB2 Clock is 1/2 of sys_clk</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>Divide by 3 PB2 Clock is 1/3 of sys_clk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16 PB2 Clock is 1/16 of sys_clk</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV17</name>
                           <description>Divide by 17 PB2 Clock is 1/17 of sys_clk</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV127</name>
                           <description>Divide by 127 PB2 Clock is 1/127 of sys_clk</description>
                           <value>0x7e</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128 PB2 Clock is 1/128 of sys_clk</description>
                           <value>0x7f</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVRDY</name>
                     <description>PB2 Peripheral Clock Divisor Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVRDYSelect</name>
                        <enumeratedValue>
                           <name>PB2RDY</name>
                           <description>Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_PB2RDY</name>
                           <description>Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVONSelect</name>
                        <enumeratedValue>
                           <name>PB2ON</name>
                           <description>PB2 Output clock is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PB2OFF</name>
                           <description>PB2 Output clock is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PB2DIVCLR</name>
               <addressOffset>0x174</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB2DIVSET</name>
               <addressOffset>0x178</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB2DIVINV</name>
               <addressOffset>0x17C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB3DIV</name>
               <description>PB3 CLOCK DIVISOR CONTROL REGISTER</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <resetValue>0x8813</resetValue>
               <fields>
                  <field>
                     <name>PBDIV</name>
                     <description>PB3 Peripheral Clock Divisor Control value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide by 1 PB3 Clock same frequency as sys_clk</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2 PB3 Clock is 1/2 of sys_clk</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>Divide by 3 PB3 Clock is 1/3 of sys_clk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16 PB3 Clock is 1/16 of sys_clk</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV17</name>
                           <description>Divide by 17 PB3 Clock is 1/17 of sys_clk</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV127</name>
                           <description>Divide by 127 PB3 Clock is 1/127 of sys_clk</description>
                           <value>0x7e</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128 PB3 Clock is 1/128 of sys_clk</description>
                           <value>0x7f</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVRDY</name>
                     <description>PB3 Peripheral Clock Divisor Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVRDYSelect</name>
                        <enumeratedValue>
                           <name>PB3RDY</name>
                           <description>Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_PB3RDY</name>
                           <description>Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVONSelect</name>
                        <enumeratedValue>
                           <name>PB3ON</name>
                           <description>PB3 Output clock is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PB3OFF</name>
                           <description>PB3 Output clock is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PB3DIVCLR</name>
               <addressOffset>0x184</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB3DIVSET</name>
               <addressOffset>0x188</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB3DIVINV</name>
               <addressOffset>0x18C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB4DIV</name>
               <description>PB4 CLOCK DIVISOR CONTROL REGISTER</description>
               <addressOffset>0x190</addressOffset>
               <size>32</size>
               <resetValue>0x8801</resetValue>
               <fields>
                  <field>
                     <name>PBDIV</name>
                     <description>PB4 Peripheral Clock Divisor Control value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide by 1 PB4 Clock same frequency as sys_clk</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2 PB4 Clock is 1/2 of sys_clk</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>Divide by 3 PB4 Clock is 1/3 of sys_clk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16 PB4 Clock is 1/16 of sys_clk</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV17</name>
                           <description>Divide by 17 PB4 Clock is 1/17 of sys_clk</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV127</name>
                           <description>Divide by 127 PB4 Clock is 1/127 of sys_clk</description>
                           <value>0x7e</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128 PB4 Clock is 1/128 of sys_clk</description>
                           <value>0x7f</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVRDY</name>
                     <description>PB4 Peripheral Clock Divisor Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVRDYSelect</name>
                        <enumeratedValue>
                           <name>PB4RDY</name>
                           <description>Indicates the PB clock divisor logic is not switching divisors and the PB4DIV may be written.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_PB4RDY</name>
                           <description>Indicates the PB clock divisor logic is currently switching values and the PB4DIV cannot be written.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVONSelect</name>
                        <enumeratedValue>
                           <name>PB4ON</name>
                           <description>PB4 Output clock is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PB4OFF</name>
                           <description>PB4 Output clock is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PB4DIVCLR</name>
               <addressOffset>0x194</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB4DIVSET</name>
               <addressOffset>0x198</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB4DIVINV</name>
               <addressOffset>0x19C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB5DIV</name>
               <description>PB5 CLOCK DIVISOR CONTROL REGISTER</description>
               <addressOffset>0x1a0</addressOffset>
               <size>32</size>
               <resetValue>0x8801</resetValue>
               <fields>
                  <field>
                     <name>PBDIV</name>
                     <description>PB5 Peripheral Clock Divisor Control value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide by 1 PB5 Clock same frequency as sys_clk</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2 PB5 Clock is 1/2 of sys_clk</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>Divide by 3 PB5 Clock is 1/3 of sys_clk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16 PB5 Clock is 1/16 of sys_clk</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV17</name>
                           <description>Divide by 17 PB5 Clock is 1/17 of sys_clk</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV127</name>
                           <description>Divide by 127 PB5 Clock is 1/127 of sys_clk</description>
                           <value>0x7e</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128 PB5 Clock is 1/128 of sys_clk</description>
                           <value>0x7f</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVRDY</name>
                     <description>PB5 Peripheral Clock Divisor Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVRDYSelect</name>
                        <enumeratedValue>
                           <name>PB5RDY</name>
                           <description>Indicates the PB clock divisor logic is not switching divisors and the PB5DIV may be written.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_PB5RDY</name>
                           <description>Indicates the PB clock divisor logic is currently switching values and the PB5DIV cannot be written.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PBDIVONSelect</name>
                        <enumeratedValue>
                           <name>PB5ON</name>
                           <description>PB5 Output clock is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PB5OFF</name>
                           <description>PB5 Output clock is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PB5DIVCLR</name>
               <addressOffset>0x1a4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB5DIVSET</name>
               <addressOffset>0x1a8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PB5DIVINV</name>
               <addressOffset>0x1ac</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
