Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
            <register>
               <name>SLEWCON</name>
               <description>SLEW RATE CONTROL FOR CLOCK SWITCHING REGISTER</description>
               <addressOffset>0x1b0</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>Clock Switch Slewing Active Status Bit - Read-Only</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BUSYSelect</name>
                        <enumeratedValue>
                           <name>FINAL</name>
                           <description>Clock Switch has reached its final value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BUSY</name>
                           <description>Clock frequency is being actively Slewed</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DNEN</name>
                     <description>Clock slew enable for switching down to slower clocks</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DNENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Clock Slewing disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Clock Slewing enabled on a clock switch</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPEN</name>
                     <description>Clock slew enable for switching up to faster clocks</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UPENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Clock Slewing disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Clock Slewing enabled on a clock switch OR exit from SLEEP</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLWDIV</name>
                     <description>Divisor steps used when doing slewed clock switches</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SLWDIVSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Divisor used</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Divide by 2, then no divisor</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4to2</name>
                           <description>Divide by 4, then by 2, then no divisor</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8to2</name>
                           <description>Divide by 8, then by 4, then by 2, then no divisor</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16to2</name>
                           <description>Divide by 16, then by 8, then by 4, then by 2, then no divisor</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32to2</name>
                           <description>Divide by 32, then by 16, then by 8, then by 4, then by 2, then no divisor</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64to2</name>
                           <description>Divide by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>128to2</name>
                           <description>Divide by 128, then by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYSDIV</name>
                     <description>PBx Peripheral Clock Divisor Control value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SYSDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide by 1- sys_clk_out same frequency as sys_clk source - Default</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2- sys_clk_out is 1/2 of sys_clk source</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>Divide by 3- sys_clk_out is 1/3 of sys_clk source</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>Divide by 4- sys_clk_out is 1/4 of sys_clk source</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV5</name>
                           <description>Divide by 5- sys_clk_out is 1/5 of sys_clk source</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV6</name>
                           <description>Divide by 6- sys_clk_out is 1/6 of sys_clk source</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV7</name>
                           <description>Divide by 7- sys_clk_out is 1/7 of sys_clk source</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>Divide by 8- sys_clk_out is 1/8 of sys_clk source</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV9</name>
                           <description>Divide by 9- sys_clk_out is 1/9 of sys_clk source</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV10</name>
                           <description>Divide by 10- sys_clk_out is 1/10 of sys_clk source</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV11</name>
                           <description>Divide by 11- sys_clk_out is 1/11 of sys_clk source</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV12</name>
                           <description>Divide by 12- sys_clk_out is 1/12 of sys_clk source</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV13</name>
                           <description>Divide by 13- sys_clk_out is 1/13 of sys_clk source</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV14</name>
                           <description>Divide by 14- sys_clk_out is 1/14 of sys_clk source</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV15</name>
                           <description>Divide by 15- sys_clk_out is 1/15 of sys_clk source</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16- sys_clk_out is 1/16 of sys_clk source</description>
                           <value>0xf</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLWDLY</name>
                     <description>Number of clocks generated at each slew step for a clock switch</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SLWDLYSelect</name>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1 clock will be generated at each slew step</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>2 clocks will be generated at each slew step</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>3 clocks will be generated at each slew step</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>4 clocks will be generated at each slew step</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>5 clocks will be generated at each slew step</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>6 clocks will be generated at each slew step</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>7 clocks will be generated at each slew step</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8</name>
                           <description>8 clocks will be generated at each slew step</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>9</name>
                           <description>9 clocks will be generated at each slew step</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>10 clocks will be generated at each slew step</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>11 clocks will be generated at each slew step</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12</name>
                           <description>12 clocks will be generated at each slew step</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>13</name>
                           <description>13 clocks will be generated at each slew step</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>14</name>
                           <description>14 clocks will be generated at each slew step</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>15</name>
                           <description>15 clocks will be generated at each slew step</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16</name>
                           <description>16 clocks will be generated at each slew step</description>
                           <value>0xf</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLEWCONCLR</name>
               <addressOffset>0x1b4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SLEWCONSET</name>
               <addressOffset>0x1b8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SLEWCONINV</name>
               <addressOffset>0x1bc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CLKSTAT</name>
               <description>CLOCK STATUS REGISTER</description>
               <addressOffset>0x1c0</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>FRCRDY</name>
                     <description>FRC Ready Status value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FRCRDYSelect</name>
                        <enumeratedValue>
                           <name>NOTRDY</name>
                           <description>FRC is not stable and not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>FRC is stable and ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLL1RDY</name>
                     <description>System PLL1 Ready Status value</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPLL1RDYSelect</name>
                        <enumeratedValue>
                           <name>NOTRDY</name>
                           <description>SPLL1 Primary Output is not stable and not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>SPLL1 Primary Output is stable and ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POSCRDY</name>
                     <description>Primary Oscillator Ready Status value</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>POSCRDYSelect</name>
                        <enumeratedValue>
                           <name>NOTRDY</name>
                           <description>POSC is not stable and not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>POSC is stable and ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SOSCRDY</name>
                     <description>SOSC Ready Status value</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SOSCRDYSelect</name>
                        <enumeratedValue>
                           <name>NOTRDY</name>
                           <description>SOSC is not stable and not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>SOSC is stable and ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPRCRDY</name>
                     <description>LPRC Ready Status value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPRCRDYSelect</name>
                        <enumeratedValue>
                           <name>NOTRDY</name>
                           <description>LPRC is not stable and not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>LPRC is stable and ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLLRDY</name>
                     <description>System PLL Ready Status value</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPLLRDYSelect</name>
                        <enumeratedValue>
                           <name>NOTRDY</name>
                           <description>SPLL is not stable and not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>SPLL is stable and ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYSRDY</name>
                     <description>System Clock Ready Status value</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SYSRDYSelect</name>
                        <enumeratedValue>
                           <name>NOTRDY</name>
                           <description>System clock is not stable and not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>System clock is stable and ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PB1RDY</name>
                     <description>PB1 Clock Ready Status value </description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PB1RDYSelect</name>
                        <enumeratedValue>
                           <name>NOTRDY</name>
                           <description>PB1 clock is not stable and not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDY</name>
                           <description>PB1 clock is stable and ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
