Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
            <register>
               <name>CLKSTATCLR</name>
               <addressOffset>0x1c4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CLKSTATSET</name>
               <addressOffset>0x1c8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CLKSTATINV</name>
               <addressOffset>0x1cc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CLKDIAG</name>
               <description>USER CLK DIAGNOSTICS CONTROL REGISTER</description>
               <addressOffset>0x1e0</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>POSCSTOP</name>
                     <description>POSC Clock Stop Control value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>POSCSTOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>POSC clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>POSC clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SOSCSTOP</name>
                     <description>SOSC Clock Stop Control value</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SOSCSTOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>SOSC clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>SOSC clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRCSTOP</name>
                     <description>FRC Clock Stop Control value</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FRCSTOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>FRC clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>FRC clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPRCSTOP</name>
                     <description>LPRC Clock Stop Control value</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPRCSTOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>LPRC clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>LPRC clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLL1STOP</name>
                     <description>SPLL1 Clock Stop Control value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPLL1STOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>SPLL1 clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>SPLL1 clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMICNT</name>
                     <description>NMI Counter value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKDIAGCLR</name>
               <addressOffset>0x1e4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CLKDIAGSET</name>
               <addressOffset>0x1e8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CLKDIAGINV</name>
               <addressOffset>0x1ec</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
