Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CVD</name>
         <version>05033Rev A.1</version>
         <description>Hardware CVD Controller Macro</description>
         <baseAddress>0x44002400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x204</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CVD</name>
            <description>CVD Interrpt</description>
            <value>48</value>
         </interrupt>
         <registers>
            <register>
               <name>CVDCON</name>
               <description>CVD Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00020000</resetValue>
               <fields>
                  <field>
                     <name>TRIGSEL</name>
                     <description>Selects one of 15 external trigger inputs to start scanning.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLKSEL</name>
                     <description>Clock Select for FSM00= UPB_FSM_CLK01= External clock source 110= External clock source 211= External clock source 3</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FIFOTH</name>
                     <description>Threshold for the results FIFO that will cause an interrupt and watermark FIFOWM status bitassertion</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FIFOTHIEN</name>
                     <description>FIFO Threshold Interrupt Enable1= Controller will assert an interrupt when the FIFO threshold is met0= Controller will not assert an interrupt when the FIFO threshold is met</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CVDIEN</name>
                     <description>Global Interrupt Enable for full macro. Gates any enabled FIFO or Scan Descriptor interrupts.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THSTR</name>
                     <description>Threshold Store Mode1= Store only results which exceed the programmed threshold for the Scan Descriptor0= Store all results in FIFO</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG</name>
                     <description>Software Trigger control. Starts scan manuallyCleared by Hardware.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT</name>
                     <description>Instructs the controller to abort the current scan. The controller will move on to the next enabled ScanDescriptor if there is one, else it will go idle.Cleared by Hardware</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDWREN</name>
                     <description>Scan Descriptor Write Enable1= Enables writes to the scan descriptors, and prevents Scan Descriptor EN bits from being decoded and captured intoFSM_CLK domain by the Descriptor Selection Logic. This simplifies synchronization issues. The currently active ScanDescriptor registers should NOT be written even if SDWREN is asserted, as the FSM uses those bits directly without asynchronizer as a means of saving gates.0= Prevents writes to the scan descriptors, and enables the Descriptor Selector Logic to decode the next Scan Descriptor to run and capture it into the FSM domain.</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ORDER</name>
                     <description>RX/TX Loop Order1= Scan all requested TX indexes, then increment RX index and continue0= Scan all requested RX indexes, then increment TX index and continue</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIDL</name>
                     <description>Stop in Idle Mode bit1= CVD controller halts when device enters Idle mode0= CVD controller continues running in Idle mode</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Freeze Mode1= CVD controller halts in debugger mode0= CVD controller runs in debugger mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ON</name>
                     <description>Enables the State Machine to scan enabled Scan Descriptors upon next trigger.</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDADC</name>
               <description>CVD ADC Configuration Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CVDCPL</name>
                     <description>Capacitor Party Line</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CVDEN</name>
                     <description>Enable CVD</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SELRES</name>
                     <description>Shared sarcore resolution select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DIFFPEN</name>
                     <description>Shared sarcore differential enabled</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANN1EN</name>
                     <description>ANN1 channel enabled</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDSTAT</name>
               <description>CVD Status Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x20000000</resetValue>
               <fields>
                  <field>
                     <name>SD1BUSY</name>
                     <description>Scan Descriptor 1 is in progress</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD1DONE</name>
                     <description>Core will set this bit if Scan Descriptor 1 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 1.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD1INT</name>
                     <description>Scan Descriptor 1 has caused an interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD2BUSY</name>
                     <description>Scan Descriptor 2 is in progress</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD2DONE</name>
                     <description>Core will set this bit if Scan Descriptor 2 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 2.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD2INT</name>
                     <description>Scan Descriptor 2 has caused an interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD3BUSY</name>
                     <description>Scan Descriptor 3 is in progress</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD3DONE</name>
                     <description>Core will set this bit if Scan Descriptor 3 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 3.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD3INT</name>
                     <description>Scan Descriptor 3 has caused an interrupt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD4BUSY</name>
                     <description>Scan Descriptor 4 is in progress</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD4DONE</name>
                     <description>Core will set this bit if Scan Descriptor 4 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 4.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SD4INT</name>
                     <description>Scan Descriptor 4 has caused an interrupt.</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCNT</name>
                     <description>Results FIFO word count: Indicates the number of words in the Results FIFO.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FIFOMT</name>
                     <description>The Results FIFO is empty.</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOWM</name>
                     <description>The Results FIFO has reached the programmed FIFOTHRESH threshold.</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOFULL</name>
                     <description>The Results FIFO is full.</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDRESH</name>
               <description>CVD RESULTS POS FIFO Read Register (CVDRESH)</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>POS</name>
                     <description>The accumulated result of the positive-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDRESL</name>
               <description>CVD RESULTS NEG FIFO Read Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NEG</name>
                     <description>The accumulated result of the negative-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDRESD</name>
               <description>CVD RESULTS DESCRIPTOR FIFO Read Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DELTA</name>
                     <description>Delta of the accumulated results of the negative-side and positive-side measurements.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
                  <field>
                     <name>RXINDEX</name>
                     <description>Receive Index for this result. If the Stride of the Scan Descriptor was more than one, the ReceiveIndex indicates the first one of the group.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SDNUM</name>
                     <description>Scan Descriptor Number that generated this result</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TXINDEX</name>
                     <description>Transmit Index for this result. If the Stride of the Scan Descriptor was more than one, the Transmit Index indicates the first one of the group.</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDRX0</name>
               <description>CVD RECEIVE INDEX 0-3 CONFIGURATION Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXAN1</name>
                     <description>ANx/CVDR channel to use for RX Index 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN2</name>
                     <description>ANx/CVDR channel to use for RX Index 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN3</name>
                     <description>ANx/CVDR channel to use for RX Index 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN4</name>
                     <description>ANx/CVDR channel to use for RX Index 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDRX1</name>
               <description>CVD RECEIVE INDEX 4-7 CONFIGURATION Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXAN5</name>
                     <description>ANx/CVDR channel to use for RX Index 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN6</name>
                     <description>ANx/CVDR channel to use for RX Index 5</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN7</name>
                     <description>ANx/CVDR channel to use for RX Index 6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN8</name>
                     <description>ANx/CVDR channel to use for RX Index 7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDRX2</name>
               <description>CVD RECEIVE INDEX 8-11 CONFIGURATION Register</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXAN9</name>
                     <description>ANx/CVDR channel to use for RX Index 8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN10</name>
                     <description>ANx/CVDR channel to use for RX Index 9</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN11</name>
                     <description>ANx/CVDR channel to use for RX Index 10</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN12</name>
                     <description>ANx/CVDR channel to use for RX Index 11</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDRX3</name>
               <description>CVD RECEIVE INDEX 12-15 CONFIGURATION Register</description>
               <addressOffset>0x8C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXAN13</name>
                     <description>ANx/CVDR channel to use for RX Index 12</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN14</name>
                     <description>ANx/CVDR channel to use for RX Index 13</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN15</name>
                     <description>ANx/CVDR channel to use for RX Index 14</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN16</name>
                     <description>ANx/CVDR channel to use for RX Index 15</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVDRX4</name>
               <description>CVD RECEIVE INDEX 16-17 CONFIGURATION Register</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXAN17</name>
                     <description>ANx/CVDR channel to use for RX Index 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXAN18</name>
                     <description>ANx/CVDR channel to use for RX Index 17</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
