Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
            <register>
               <name>ACTIVE</name>
               <description>Active Channel and Levels</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LVLEX0</name>
                     <description>Level 0 Channel Trigger Request Executing</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEX1</name>
                     <description>Level 1 Channel Trigger Request Executing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEX2</name>
                     <description>Level 2 Channel Trigger Request Executing</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEX3</name>
                     <description>Level 3 Channel Trigger Request Executing</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID</name>
                     <description>Active Channel ID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ABUSY</name>
                     <description>Active Channel Busy</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTCNT</name>
                     <description>Active Channel Block Transfer Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASEADDR</name>
               <description>Descriptor Memory Section Base Address</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BASEADDR</name>
                     <description>Descriptor Memory Base Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WRBADDR</name>
               <description>Write-Back Memory Section Base Address</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WRBADDR</name>
                     <description>Write-Back Memory Base Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>16</dim>
               <dimIncrement>0x10</dimIncrement>
               <name>CHANNEL[%s]</name>
               <description/>
               <addressOffset>0x40</addressOffset>
               <register>
                  <name>CHCTRLA</name>
                  <description>Channel n Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Channel Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Channel Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Channel Run in Standby</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TRIGSRC</name>
                        <description>Trigger Source</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                        <enumeratedValues>
                           <name>TRIGSRCSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Only software/event triggers</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RTC_DMAC_ID_TIMESTAMP</name>
                              <description>Trigger source is RTC</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DSU_DMAC_ID_DCC0</name>
                              <description>Trigger source is DSU DCC0</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DSU_DMAC_ID_DCC1</name>
                              <description>Trigger source is DSU DCC1</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM0_DMAC_ID_RX</name>
                              <description>Trigger source is SERCOM0 RX</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM0_DMAC_ID_TX</name>
                              <description>Trigger source is SERCOM0 TX</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM1_DMAC_ID_RX</name>
                              <description>Trigger source is SERCOM1 RX</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM1_DMAC_ID_TX</name>
                              <description>Trigger source is SERCOM1 TX</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM2_DMAC_ID_RX</name>
                              <description>Trigger source is SERCOM2 RX</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM2_DMAC_ID_TX</name>
                              <description>Trigger source is SERCOM2 TX</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM3_DMAC_ID_RX</name>
                              <description>Trigger source is SERCOM3 RX</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM3_DMAC_ID_TX</name>
                              <description>Trigger source is SERCOM3 TX</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM6_DMAC_ID_RX</name>
                              <description>Trigger source is SERCOM6 RX</description>
                              <value>16</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SERCOM6_DMAC_ID_TX</name>
                              <description>Trigger source is SERCOM6 TX</description>
                              <value>17</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC0_DMAC_ID_OVF</name>
                              <description>Trigger source is TCC0 OVF</description>
                              <value>18</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC0_DMAC_ID_MC_0</name>
                              <description>Trigger source is TCC0 MC0</description>
                              <value>19</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC0_DMAC_ID_MC_1</name>
                              <description>Trigger source is TCC0 MC1</description>
                              <value>20</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC0_DMAC_ID_MC_2</name>
                              <description>Trigger source is TCC0 MC2</description>
                              <value>21</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC0_DMAC_ID_MC_3</name>
                              <description>Trigger source is TCC0 MC3</description>
                              <value>22</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC0_DMAC_ID_MC_4</name>
                              <description>Trigger source is TCC0 MC4</description>
                              <value>23</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC0_DMAC_ID_MC_5</name>
                              <description>Trigger source is TCC0 MC5</description>
                              <value>24</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC1_DMAC_ID_OVF</name>
                              <description>Trigger source is TCC1 OVF</description>
                              <value>25</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC1_DMAC_ID_MC_0</name>
                              <description>Trigger source is TCC1 MC0</description>
                              <value>26</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC1_DMAC_ID_MC_1</name>
                              <description>Trigger source is TCC1 MC1</description>
                              <value>27</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC1_DMAC_ID_MC_2</name>
                              <description>Trigger source is TCC1 MC2</description>
                              <value>28</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC1_DMAC_ID_MC_3</name>
                              <description>Trigger source is TCC1 MC3</description>
                              <value>29</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC1_DMAC_ID_MC_4</name>
                              <description>Trigger source is TCC1 MC4</description>
                              <value>30</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC1_DMAC_ID_MC_5</name>
                              <description>Trigger source is TCC1 MC5</description>
                              <value>31</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC2_DMAC_ID_OVF</name>
                              <description>Trigger source is TCC2 OVF</description>
                              <value>32</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC2_DMAC_ID_MC_0</name>
                              <description>Trigger source is TCC2 MC0</description>
                              <value>33</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCC2_DMAC_ID_MC_1</name>
                              <description>Trigger source is TCC2 MC1</description>
                              <value>34</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC0_DMAC_ID_OVF</name>
                              <description>Trigger source is TCO OVF</description>
                              <value>35</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC0_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC0 MC0</description>
                              <value>36</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC0_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC0 MC1</description>
                              <value>37</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC1_DMAC_ID_OVF</name>
                              <description>Trigger source is TC1 OVF</description>
                              <value>38</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC1_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC1 MC0</description>
                              <value>39</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC1_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC1 MC1</description>
                              <value>40</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC2_DMAC_ID_OVF</name>
                              <description>Trigger source is TC2 OVF</description>
                              <value>41</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC2_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC2 MC0</description>
                              <value>42</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC2_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC2 MC1</description>
                              <value>43</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC3_DMAC_ID_OVF</name>
                              <description>Trigger source is TC3 OVF</description>
                              <value>44</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC3_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC3 MC0</description>
                              <value>45</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC3_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC3 MC1</description>
                              <value>46</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC4_DMAC_ID_OVF</name>
                              <description>Trigger source is TC4 OVF</description>
                              <value>47</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC4_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC4 MC0</description>
                              <value>48</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC4_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC4 MC1</description>
                              <value>49</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC5_DMAC_ID_OVF</name>
                              <description>Trigger source is TC5 OVF</description>
                              <value>50</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC5_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC5 MC0</description>
                              <value>51</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC5_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC5 MC1</description>
                              <value>52</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC6_DMAC_ID_OVF</name>
                              <description>Trigger source is TC6 OVF</description>
                              <value>53</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC6_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC6 MC0</description>
                              <value>54</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC6_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC6 MC1</description>
                              <value>55</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC7_DMAC_ID_OVF</name>
                              <description>Trigger source is TC7 OVF</description>
                              <value>56</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC7_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC7 MC0</description>
                              <value>57</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC7_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC7 MC1</description>
                              <value>58</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC8_DMAC_ID_OVF</name>
                              <description>Trigger source is TC8 OVF</description>
                              <value>59</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC8_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC8 MC0</description>
                              <value>60</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC8_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC8 MC1</description>
                              <value>61</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC9_DMAC_ID_OVF</name>
                              <description>Trigger source is TC9 OVF</description>
                              <value>62</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC9_DMAC_ID_MC_0</name>
                              <description>Trigger source is TC9 MC0</description>
                              <value>63</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC9_DMAC_ID_MC_1</name>
                              <description>Trigger source is TC9 MC1</description>
                              <value>64</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>QSPI_DMAC_ID_RX</name>
                              <description>Trigger source is QSPI RX</description>
                              <value>65</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>QSPI_DMAC_ID_TX</name>
                              <description>Trigger source is QSPI TX</description>
                              <value>66</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRIGACT</name>
                        <description>Trigger Action</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TRIGACTSelect</name>
                           <enumeratedValue>
                              <name>BLOCK</name>
                              <description>One trigger required for each block transfer</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BURST</name>
                              <description>One trigger required for each burst transfer</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
