Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
            <register>
               <name>DPRESCALER</name>
               <description>Debouncer Prescaler</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRESCALER0</name>
                     <description>Debouncer Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PRESCALER0Select</name>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>EIC clock divided by 2</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>EIC clock divided by 4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>EIC clock divided by 8</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>EIC clock divided by 16</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>EIC clock divided by 32</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>EIC clock divided by 64</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>EIC clock divided by 128</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV256</name>
                           <description>EIC clock divided by 256</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STATES0</name>
                     <description>Debouncer number of states</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>STATES0Select</name>
                        <enumeratedValue>
                           <name>LFREQ3</name>
                           <description>3 low frequency samples</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LFREQ7</name>
                           <description>7 low frequency samples</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TICKON</name>
                     <description>Pin Sampler frequency selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TICKONSelect</name>
                        <enumeratedValue>
                           <name>CLK_GCLK_EIC</name>
                           <description>Clocked by GCLK</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_LFREQ</name>
                           <description>Clocked by Low Frequency Clock</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PINSTATE</name>
               <description>Pin State</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PINSTATE</name>
                     <description>Pin State</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>EFUSE</name>
         <version>EIP_005041.0.0</version>
         <baseAddress>0x0</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1E8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SECCFG0</name>
               <description>Secure Configuration</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>UUID_LCK</name>
                     <description>Programming lock bits for Unique ID fuses</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>UUID_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Unique ID is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEBUG_LCK</name>
                     <description>Lock bits for debug/programming</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEBUG_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Debug is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Debug is locked</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Debug is locked</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Debug is locked</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECCFG1</name>
               <description>Secure Configuration</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ROOT_KEY_LCK</name>
                     <description>Lock bits for storage root Key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ROOT_KEY_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Storage root key is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOT_KEY_LCK</name>
                     <description>Lock bits for Secure Boot/OTA Key</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BOOT_KEY_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Secure boot key is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECCFG2</name>
               <description>Secure Configuration</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ADD_BOOT_KEY</name>
                     <description>Additional boot Key bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>32</dim>
               <dimIncrement>1</dimIncrement>
               <name>ANTIROLLBACKCOUNTER[%s]</name>
               <description>Anti Roll back counter</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ANTIROLLBACKCOUNTER</name>
                     <description>Anti rollback counter bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>1</dimIncrement>
               <name>LIFECYCLECOUNTER[%s]</name>
               <description>Life cycle counter</description>
               <addressOffset>0x24</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>LIFECYCLECOUNTER</name>
                     <description>Life cycle counter bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>48</dim>
               <dimIncrement>1</dimIncrement>
               <name>SECUREBOOTKEY[%s]</name>
               <description>Secure boot key</description>
               <addressOffset>0x26</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SECUREBOOTKEY</name>
                     <description>Secure boot key bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>1</dimIncrement>
               <name>UUID[%s]</name>
               <description>Unique ID</description>
               <addressOffset>0x1D8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>UUID</name>
                     <description>Unique ID bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
