Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
            <register>
               <name>RPB9G3R</name>
               <addressOffset>0x330</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RPB9G3R</name>
                     <description>RPB9/G3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>RPB9G3RSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CCLO0</name>
                           <description>CCL/OUT0</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P0</name>
                           <description>SERCOM0/PAD0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P3</name>
                           <description>SERCOM0/PAD3</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P2</name>
                           <description>SERCOM1/PAD2</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P0</name>
                           <description>SERCOM1/PAD0</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P3</name>
                           <description>SERCOM1/PAD3</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM2P0</name>
                           <description>SERCOM2/PAD0</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM2P3</name>
                           <description>SERCOM2/PAD3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P2</name>
                           <description>SERCOM3/PAD2</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P0</name>
                           <description>SERCOM3/PAD0</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P3</name>
                           <description>SERCOM3/PAD3</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO2</name>
                           <description>TCC0/WO2</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO0</name>
                           <description>TCC0/WO0</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO4</name>
                           <description>TCC0/WO4</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO2</name>
                           <description>TCC1/WO2</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO0</name>
                           <description>TCC1/WO0</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO4</name>
                           <description>TCC1/WO4</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2WO0</name>
                           <description>TCC2/WO0</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0WO0</name>
                           <description>TC0/WO0</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC1WO0</name>
                           <description>TC1/WO0</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2WO0</name>
                           <description>TC2/WO0</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC3WO0</name>
                           <description>TC3/WO0</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC4WO0</name>
                           <description>TC4/WO0</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC5WO0</name>
                           <description>TC5/WO0</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC6WO0</name>
                           <description>TC6/WO0</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC7WO0</name>
                           <description>TC7/WO0</description>
                           <value>31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC8WO0</name>
                           <description>TC8/WO0</description>
                           <value>32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC9WO1</name>
                           <description>TC9/WO1</description>
                           <value>33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPICS</name>
                           <description>QSPI/CS</description>
                           <value>34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD1</name>
                           <description>QSPI/DATA1</description>
                           <value>35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD0</name>
                           <description>QSPI/DATA0</description>
                           <value>36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD3</name>
                           <description>QSPI/DATA3</description>
                           <value>37</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS1</name>
                           <description>TSTBUS1</description>
                           <value>38</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS10</name>
                           <description>TSTBUS10</description>
                           <value>39</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_CMP0</name>
                           <description>AC/CMP0</description>
                           <value>40</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_CMPTRDY</name>
                           <description>AC/CMPTRDY</description>
                           <value>41</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FECTRL4</name>
                           <description>FECTRL4</description>
                           <value>42</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPB9G6R</name>
               <addressOffset>0x334</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RPB9G6R</name>
                     <description>RPB9/G6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>RPB9G6RSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P1</name>
                           <description>SERCOM0/PAD1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P1</name>
                           <description>SERCOM1/PAD1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM2P1</name>
                           <description>SERCOM2/PAD1</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P1</name>
                           <description>SERCOM3/PAD1</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPI_SCK</name>
                           <description>QSPI/SCK</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO1</name>
                           <description>REFO1</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO2</name>
                           <description>REFO2</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO3</name>
                           <description>REFO3</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFO4</name>
                           <description>REFO4</description>
                           <value>11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPB10G3R</name>
               <addressOffset>0x338</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RPB10G3R</name>
                     <description>RPB10/G3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>RPB10G3RSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CCLO0</name>
                           <description>CCL/OUT0</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P0</name>
                           <description>SERCOM0/PAD0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM0P3</name>
                           <description>SERCOM0/PAD3</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P2</name>
                           <description>SERCOM1/PAD2</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P0</name>
                           <description>SERCOM1/PAD0</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM1P3</name>
                           <description>SERCOM1/PAD3</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM2P0</name>
                           <description>SERCOM2/PAD0</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM2P3</name>
                           <description>SERCOM2/PAD3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P2</name>
                           <description>SERCOM3/PAD2</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P0</name>
                           <description>SERCOM3/PAD0</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCOM3P3</name>
                           <description>SERCOM3/PAD3</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO2</name>
                           <description>TCC0/WO2</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO0</name>
                           <description>TCC0/WO0</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0WO4</name>
                           <description>TCC0/WO4</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO2</name>
                           <description>TCC1/WO2</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO0</name>
                           <description>TCC1/WO0</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1WO4</name>
                           <description>TCC1/WO4</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2WO0</name>
                           <description>TCC2/WO0</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0WO0</name>
                           <description>TC0/WO0</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC1WO0</name>
                           <description>TC1/WO0</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2WO0</name>
                           <description>TC2/WO0</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC3WO0</name>
                           <description>TC3/WO0</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC4WO0</name>
                           <description>TC4/WO0</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC5WO0</name>
                           <description>TC5/WO0</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC6WO0</name>
                           <description>TC6/WO0</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC7WO0</name>
                           <description>TC7/WO0</description>
                           <value>31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC8WO0</name>
                           <description>TC8/WO0</description>
                           <value>32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC9WO1</name>
                           <description>TC9/WO1</description>
                           <value>33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPICS</name>
                           <description>QSPI/CS</description>
                           <value>34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD1</name>
                           <description>QSPI/DATA1</description>
                           <value>35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD0</name>
                           <description>QSPI/DATA0</description>
                           <value>36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QD3</name>
                           <description>QSPI/DATA3</description>
                           <value>37</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS1</name>
                           <description>TSTBUS1</description>
                           <value>38</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTBUS10</name>
                           <description>TSTBUS10</description>
                           <value>39</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_CMP0</name>
                           <description>AC/CMP0</description>
                           <value>40</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_CMPTRDY</name>
                           <description>AC/CMPTRDY</description>
                           <value>41</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FECTRL4</name>
                           <description>FECTRL4</description>
                           <value>42</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
