Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
            <register>
               <name>QEIIOC</name>
               <description>QEI I/O Control Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>QEA</name>
                     <description>Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>QEASelect</name>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Status of QEA input pin after polarity control and SWPAB pin swapping</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Status of QEA input pin after polarity control and SWPAB pin swapping</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QEB</name>
                     <description>Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>QEBSelect</name>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Status of QEB input pin after polarity control and SWPAB pin swapping</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Status of QEB input pin after polarity control and SWPAB pin swapping</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INDEX</name>
                     <description>Status of INDXx Input Pin after Polarity Control bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HOME</name>
                     <description>Status of HOMEx Input Pin after Polarity Control bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QEAPOL</name>
                     <description>QEAx Input Polarity Select bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>QEAPOLSelect</name>
                        <enumeratedValue>
                           <name>INVERT</name>
                           <description>Input is inverted</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Input is not inverted</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QEBPOL</name>
                     <description>QEBx Input Polarity Select bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>QEBPOLSelect</name>
                        <enumeratedValue>
                           <name>INVERT</name>
                           <description>Input is inverted</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Input is not inverted</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IDXPOL</name>
                     <description>INDXx Input Polarity Select bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>IDXPOLSelect</name>
                        <enumeratedValue>
                           <name>INVERT</name>
                           <description>Input is inverted</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Input is not inverted</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HOMPOL</name>
                     <description>HOMEx Input Polarity Select bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HOMPOLSelect</name>
                        <enumeratedValue>
                           <name>INVERT</name>
                           <description>Input is inverted</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Input is not inverted</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWPAB</name>
                     <description>Swap QEA and QEB Inputs bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SWPABSelect</name>
                        <enumeratedValue>
                           <name>SWAP</name>
                           <description>QEAx and QEBx are swapped prior to quadrature decoder logic</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>QEAx and QEBx are not swapped</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTFNC</name>
                     <description>QEI Module Output Function Mode Select bits</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OUTFNCSelect</name>
                        <enumeratedValue>
                           <name>EITHER</name>
                           <description>The position coutner is either case</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LESS_THAN</name>
                           <description>The position counter less than or equal to the range of CMPLH and CMPLL</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GREATER_THAN</name>
                           <description>The position counter greater than or equal to the range of ICCH and ICCL</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Output is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QFDIV</name>
                     <description>QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>QFDIVSelect</name>
                        <enumeratedValue>
                           <name>1_128</name>
                           <description>1:128 clock divide</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_64</name>
                           <description>1:64 clock divide</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_32</name>
                           <description>1:32 clock divide</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_16</name>
                           <description>1:16 clock divide</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_8</name>
                           <description>1:8 clock divide</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_4</name>
                           <description>1:4 clock divide</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_2</name>
                           <description>1:2 clock divide</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_1</name>
                           <description>1:1 clock divide</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLTREN</name>
                     <description>QEA/QEB/INDX/HOMEx Digital Filter Enable bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FLTRENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Input Pin Digital filter is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Input Pin Digital filter is disabled (bypassed)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QCAPEN</name>
                     <description>Position Counter Input Capture Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>QCAPENSelect</name>
                        <enumeratedValue>
                           <name>TRIGGERED</name>
                           <description>Positive edge detect of Home input triggers position capture function</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_TRIGGERED</name>
                           <description>Home input event (positive edge) does not trigger a capture even</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HCAPEN</name>
                     <description>Position Counter Input Capture by Home Event Enable bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HCAPENSelect</name>
                        <enumeratedValue>
                           <name>TRIGGERED</name>
                           <description>HOMEx input event (positive edge) triggers a position capture event</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_TRIGGERED</name>
                           <description>HOMEx input event (positive edge) does not trigger a position capture event</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>QQEIIOCCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>QEIIOCSET</name>
               <description>Bit set register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>QEIIOCINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x1c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
