Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ROT</name>
         <version>05544Rev A.1</version>
         <description>Secure Root of Trust Macro</description>
         <baseAddress>0x44003000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC0C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SECCFG</name>
               <description>Secure Configuration HOLDING REGISTER1,2</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UUID_LCK</name>
                     <description>Programming lock bits for Unique ID fuses</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>UUID_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Unique ID is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEBUG_LCK</name>
                     <description>Lock bits for debug/programming</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEBUG_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Debug is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Debug is locked</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Debug is locked</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Debug is locked</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROOT_KEY_LCK</name>
                     <description>Lock bits for storage root Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ROOT_KEY_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Storage root key is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOT_KEY_LCK</name>
                     <description>Lock bits for Secure Boot/OTA Key</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BOOT_KEY_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Secure boot key is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PATCH_LCK</name>
                     <description>Lock bits for patch</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PATCH_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Patch config and code are not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Patch config and code are locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Patch config and code are locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Patch config and code are locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADD_BOOT_KEY</name>
                     <description>Additional boot Key bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>ANTIROLLBACKCOUNTER[%s]</name>
               <description>Anti Roll back counter</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ANTIROLLBACKCOUNTER</name>
                     <description>Anti rollback counter bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIFECYCLECTR_BOOTKEY</name>
               <description>Life cycle counter and Secure boot key LSB bytes</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LIFECYCLECOUNTER</name>
                     <description>Life cycle counter bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SECUREBOOTKEY_1_2</name>
                     <description>Secure boot key bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>11</dim>
               <dimIncrement>4</dimIncrement>
               <name>SECUREBOOTKEY_3_46[%s]</name>
               <description>Secure boot key</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECUREBOOTKEY_3_46</name>
                     <description>Secure boot key bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECUREBOOTKEY_47_48_STORAGE_KEY</name>
               <description>Secure boot key, Storage Key</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECUREBOOTKEY_47_48</name>
                     <description>Secure boot key bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>STORAGE_KEY_1_2</name>
                     <description>Storage root key bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>7</dim>
               <dimIncrement>4</dimIncrement>
               <name>STORAGE_KEY_3_30[%s]</name>
               <description>Storage Key</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STORAGE_KEY_3_30</name>
                     <description>Storage Key bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STORAGE_KEY_FFCFG</name>
               <description>Storage Key, FFCFG</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STORAGE_KEY_31_32</name>
                     <description>Storage Key bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DEV_ID_LCK</name>
                     <description>Device ID bits</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEV_ID_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Device ID fuses are not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Device ID fuses are locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Device ID fuses are locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Device ID fuses are locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIE_INFO_LCK</name>
                     <description>Die info bits</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DIE_INFO_LCKSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Die information fuses are not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Die information fuses are locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Die information fuses are locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Die information fuses are locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVICE_ID_PATCH_CFG</name>
               <description>Device ID and Patch CFG</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VSEL</name>
                     <description>VSEL of device ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PATCH_CFG1_LB</name>
                     <description>Patch CFG-1 lower 16 bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PATCH_CFG</name>
               <description>Patch CFG</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PATCH_CFG1_HB</name>
                     <description>Patch CFG-1 higher 8 bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PATCH_CFG2</name>
                     <description>Patch CFG-2 bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>60</dim>
               <dimIncrement>4</dimIncrement>
               <name>PATCH_CODE[%s]</name>
               <description>Patch Code</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PATCH_CODE</name>
                     <description>Patch Code bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>UUID[%s]</name>
               <description>Unique ID</description>
               <addressOffset>0x170</addressOffset>
               <size>32</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>UUID</name>
                     <description>Unique ID bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SEC_BOOT</name>
               <description>Secure Boot Register</description>
               <addressOffset>0xC00</addressOffset>
               <size>32</size>
               <resetValue>0x00010002</resetValue>
               <fields>
                  <field>
                     <name>SEC_BOOT_REQD</name>
                     <description>Bits to indicate that secure boot is required on the next device reset.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SEC_BOOT_REQDSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>S ecure boot code authentication is required</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>S ecure boot code authentication is NOT required</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>S ecure boot code authentication is NOT required</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>S ecure boot code authentication is required</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEC_FLASH_NOT_DIRTY</name>
                     <description>Bits to indicate whether the Flash contents have been changed since the last code authentication operation</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SEC_FLASH_NOT_DIRTYSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Flash contents have changed since the last authentication</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Flash contents have changed since the last authentication</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Flash contents have changed since the last authentication</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Flash contents have not changed since the last authentication</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEC_BOOT_STATUS</name>
                     <description>Bits to indicate that secure boot status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SEC_BOOT_DONE</name>
                     <description>Bits to indicate that secure boot is done</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SEC_BOOT_DONESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>S ecure boot is done</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>S ecure boot is not done</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>S ecure boot is not done</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>S ecure boot is done</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
