Ac6Embedded/svd-microchip/PIC32CX_BZ6/PIC32CX2051BZ66048.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC1</name>
         <baseAddress>0x40003800</baseAddress>
         <interrupt>
            <name>TCC1</name>
            <description>Timer/Counter for Control Applications 1</description>
            <value>23</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC2</name>
         <baseAddress>0x40003C00</baseAddress>
         <interrupt>
            <name>TCC2</name>
            <description>Timer/Counter for Control Applications 2</description>
            <value>24</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TPI</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Trace Port Interface Register</description>
         <baseAddress>0xE0040000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xFD0</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SSPSR</name>
               <description>Supported Parallel Port Size Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>CSPSR</name>
               <description>Current Parallel Port Size Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>ACPR</name>
               <description>Asynchronous Clock Prescaler Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRESCALER</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPPR</name>
               <description>Selected Pin Protocol Register</description>
               <addressOffset>0xF0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXMODE</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFSR</name>
               <description>Formatter and Flush Status Register</description>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FlInProg</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FtStopped</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCPresent</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FtNonStop</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFCR</name>
               <description>Formatter and Flush Control Register</description>
               <addressOffset>0x304</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EnFCont</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TrigIn</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSCR</name>
               <description>Formatter Synchronization Counter Register</description>
               <addressOffset>0x308</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>TRIGGER</name>
               <description>TRIGGER</description>
               <addressOffset>0xEE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TRIGGER</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIFO0</name>
               <description>Integration ETM Data</description>
               <addressOffset>0xEEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ETM0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ETM1</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ETM2</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ETM_bytecount</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ETM_ATVALID</name>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITM_bytecount</name>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ITM_ATVALID</name>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ITATBCTR2</name>
               <description>ITATBCTR2</description>
               <addressOffset>0xEF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ATREADY</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ITATBCTR0</name>
               <description>ITATBCTR0</description>
               <addressOffset>0xEF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ATREADY</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIFO1</name>
               <description>Integration ITM Data</description>
               <addressOffset>0xEFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ITM0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ITM1</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ITM2</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ETM_bytecount</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ETM_ATVALID</name>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITM_bytecount</name>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ITM_ATVALID</name>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ITCTRL</name>
               <description>Integration Mode Control</description>
               <addressOffset>0xF00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>Mode</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLAIMSET</name>
               <description>Claim tag set</description>
               <addressOffset>0xFA0</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>CLAIMCLR</name>
               <description>Claim tag clear</description>
               <addressOffset>0xFA4</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>DEVID</name>
               <description>TPIU_DEVID</description>
               <addressOffset>0xFC8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NrTraceInput</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AsynClkIn</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MinBufSz</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PTINVALID</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MANCVALID</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRZVALID</name>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVTYPE</name>
               <description>TPIU_DEVTYPE</description>
               <addressOffset>0xFCC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SubType</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MajorType</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
